{
  "version": "1.0.0",
  "generatedAt": "2025-09-19T12:47:37.258Z",
  "lastUpdated": "2025-09-19T12:47:37.259Z",
  "countries": {
    "USA": {
      "holidays": [
        {
          "name_en": "Independence Day",
          "name_es": "Día de la Independencia",
          "description_en": "A federal holiday commemorating the Declaration of Independence of the United States on July 4, 1776, celebrated with fireworks and patriotic displays.",
          "description_es": "Un feriado federal que conmemora la Declaración de Independencia de los Estados Unidos el 4 de julio de 1776, celebrado con fuegos artificiales y exhibiciones patrióticas.",
          "date": "July 4",
          "season": "Summer",
          "dateType": "fixed",
          "clothing": "Casual summer wear in red, white, and blue; patriotic-themed shirts and accessories.",
          "elements": "Fireworks, barbecue grills, picnic blankets, sparklers, American flags, parade floats.",
          "visualSymbols": "American flag, bald eagle, Statue of Liberty, fireworks, stars and stripes motif.",
          "locations": "Parks, backyards, beaches, city streets for parades, public squares for fireworks displays.",
          "timeOfDay": "Daytime for parades and barbecues, night for fireworks.",
          "activities": "Watching fireworks displays, attending parades, hosting barbecues, picnics, concerts, baseball games.",
          "colorPalette": "Red, white, blue.",
          "flagIsProminent": true,
          "soundEffects": "Fireworks exploding and whistling, cheering crowds, sizzling barbecue, marching band drums, patriotic music.",
          "musicStyles": "Patriotic anthems ('The Star-Spangled Banner'), marching band music, American rock and country music."
        },
        {
          "name_en": "Halloween",
          "name_es": "Halloween / Noche de Brujas",
          "description_en": "A holiday celebrated on October 31 with activities like trick-or-treating, costume parties, and carving pumpkins into jack-o'-lanterns.",
          "description_es": "Una festividad celebrada el 31 de octubre con actividades como pedir dulces, fiestas de disfraces y tallar calabazas para hacer linternas.",
          "date": "October 31",
          "season": "Fall",
          "dateType": "fixed",
          "clothing": "Costumes of all kinds: scary, funny, fantasy, pop culture characters.",
          "elements": "Jack-o'-lanterns, fake cobwebs, skeletons, ghosts, witches' hats, cauldrons, candy.",
          "visualSymbols": "Pumpkins, bats, black cats, spiders, skulls, ghosts, monsters.",
          "locations": "Suburban neighborhoods, decorated homes (haunted houses), pumpkin patches, party venues.",
          "timeOfDay": "Evening and night.",
          "activities": "Trick-or-treating, costume parties, watching horror movies, visiting haunted attractions, carving pumpkins.",
          "colorPalette": "Orange, black, purple, dark green, blood red.",
          "flagIsProminent": false,
          "soundEffects": "Spooky screams, creaking doors, howling wind, eerie laughter, owls hooting, doorbell rings.",
          "musicStyles": "Spooky ambient music, novelty Halloween songs (e.g., 'Monster Mash'), horror movie soundtracks."
        },
        {
          "name_en": "Christmas",
          "name_es": "Navidad",
          "description_en": "A Christian holiday celebrating the birth of Jesus, widely celebrated as a cultural holiday with gift-giving, feasts, and festive decorations.",
          "description_es": "Una festividad cristiana que celebra el nacimiento de Jesús, ampliamente celebrada como una fiesta cultural con intercambio de regalos, banquetes y decoraciones festivas.",
          "date": "December 25",
          "season": "Winter",
          "dateType": "fixed",
          "clothing": "Ugly Christmas sweaters, Santa hats, formal holiday attire, festive pajamas.",
          "elements": "Christmas trees, string lights, ornaments, wreaths, stockings, nativity scenes, mistletoe, wrapped presents.",
          "visualSymbols": "Santa Claus, reindeer, snowflakes, stars, angels, candy canes, elves.",
          "locations": "Homes, churches, shopping malls, town squares with large trees, Christmas markets.",
          "timeOfDay": "Christmas Eve night and Christmas Day morning and afternoon.",
          "activities": "Decorating the tree, exchanging gifts, singing carols, attending church services, large family feasts.",
          "colorPalette": "Red, green, white, gold, silver, icy blue.",
          "flagIsProminent": false,
          "soundEffects": "Jingle bells, crackling fireplace, children's laughter, tearing wrapping paper, carolers singing.",
          "musicStyles": "Christmas carols, classical holiday music, pop Christmas songs, church hymns."
        },
        {
          "name_en": "Thanksgiving",
          "name_es": "Día de Acción de Gracias",
          "description_en": "A national holiday for giving thanks for the harvest and the preceding year, centered around a large meal with family and friends.",
          "description_es": "Una fiesta nacional para dar gracias por la cosecha y el año anterior, centrada en una gran comida con familiares y amigos.",
          "date": "Fourth Thursday of November",
          "season": "Fall",
          "dateType": "variable",
          "clothing": "Comfortable, semi-formal 'autumn' attire; sweaters, warm-toned button-down shirts, cozy fabrics.",
          "elements": "Roasted turkey, cornucopia, pumpkins, autumn leaves, elaborate dining tables, pies.",
          "visualSymbols": "Turkey, pilgrims' hats, cornucopia (horn of plenty), gourds, fall foliage.",
          "locations": "Homes, dining rooms, kitchens, football stadiums, parade routes (New York City).",
          "timeOfDay": "Late afternoon to early evening for the main meal.",
          "activities": "Cooking and eating a large meal, watching American football, viewing the Macy's Thanksgiving Day Parade, expressing gratitude.",
          "colorPalette": "Brown, orange, yellow, deep red, beige, forest green.",
          "flagIsProminent": false,
          "soundEffects": "Clinking silverware, family chatter and laughter, football game sounds on TV, oven timer.",
          "musicStyles": "Soft, ambient music; classic American folk, light jazz, or instrumental music."
        },
        {
          "name_en": "Easter",
          "name_es": "Pascua",
          "description_en": "A Christian festival commemorating the resurrection of Jesus, also celebrated as a cultural holiday associated with spring, rabbits, and eggs.",
          "description_es": "Una festividad cristiana que conmemora la resurrección de Jesús, también celebrada como una fiesta cultural asociada con la primavera, los conejos y los huevos.",
          "date": "First Sunday after the full moon following the spring equinox",
          "season": "Spring",
          "dateType": "lunar",
          "clothing": "Pastel-colored dresses, suits, and 'Sunday best' attire; children's bonnets and bow ties.",
          "elements": "Decorated Easter eggs, Easter baskets with colorful grass, chocolate bunnies, lilies, tulips.",
          "visualSymbols": "Easter Bunny, decorated eggs, crosses, lambs, chicks, blooming flowers.",
          "locations": "Churches, homes, parks, gardens, White House lawn for the Egg Roll.",
          "timeOfDay": "Morning for church services and egg hunts, afternoon for family meals.",
          "activities": "Attending church services, Easter egg hunts, dyeing eggs, family brunch or dinner.",
          "colorPalette": "Pastel colors: light pink, baby blue, mint green, lavender, pale yellow.",
          "flagIsProminent": false,
          "soundEffects": "Children laughing and shouting during egg hunts, church bells, birds chirping, gentle spring breeze.",
          "musicStyles": "Christian hymns, choir music, light classical or spring-themed instrumental music."
        },
        {
          "name_en": "New Year's Day",
          "name_es": "Día de Año Nuevo",
          "description_en": "A holiday celebrating the first day of the new year, marked by parties on New Year's Eve and resolutions for the coming year.",
          "description_es": "Una festividad que celebra el primer día del nuevo año, marcada por fiestas en la víspera de Año Nuevo y propósitos para el año venidero.",
          "date": "January 1",
          "season": "Winter",
          "dateType": "fixed",
          "clothing": "Formal wear (tuxedos, gowns, sequined dresses) for Eve parties; casual and comfortable for Day.",
          "elements": "Confetti, streamers, champagne glasses, noisemakers, the Times Square Ball, countdown clocks.",
          "visualSymbols": "Clock striking midnight, fireworks, popping champagne bottle, 'Happy New Year' banners.",
          "locations": "Times Square (NYC), homes, bars, clubs, concert venues, rooftops.",
          "timeOfDay": "New Year's Eve night leading into the stroke of midnight.",
          "activities": "Watching the ball drop, countdowns, toasting with champagne, singing 'Auld Lang Syne', fireworks.",
          "colorPalette": "Black, gold, silver, metallic colors, deep blue.",
          "flagIsProminent": false,
          "soundEffects": "Loud crowd counting down, corks popping, fireworks exploding, noisemakers, celebratory music.",
          "musicStyles": "Upbeat pop, dance, and electronic music; celebratory classical (e.g., Strauss waltzes)."
        },
        {
          "name_en": "St. Patrick's Day",
          "name_es": "Día de San Patricio",
          "description_en": "A cultural and religious holiday celebrating the patron saint of Ireland, now a wider celebration of Irish culture with parades and green-themed festivities.",
          "description_es": "Una fiesta cultural y religiosa que celebra al santo patrón de Irlanda, ahora una celebración más amplia de la cultura irlandesa con desfiles y festividades temáticas de color verde.",
          "date": "March 17",
          "season": "Spring",
          "dateType": "fixed",
          "clothing": "Green clothing and accessories, shamrock motifs, leprechaun hats, novelty t-shirts.",
          "elements": "Shamrocks (clovers), leprechauns, pots of gold, rainbows, green beer, Irish flags.",
          "visualSymbols": "Shamrock, leprechaun, harp, Celtic knot, green rivers (in some cities).",
          "locations": "City streets for parades, Irish pubs, bars, homes.",
          "timeOfDay": "All day, with parades in the morning/afternoon and pub celebrations into the night.",
          "activities": "Attending parades, drinking green beer, eating corned beef and cabbage, listening to Irish music.",
          "colorPalette": "Green (various shades), gold, white, orange.",
          "flagIsProminent": false,
          "soundEffects": "Bagpipes, cheering parade crowds, pub chatter, Irish step dancing shoes on wood.",
          "musicStyles": "Irish folk music, Celtic punk (e.g., The Pogues), pub songs, bagpipe and fiddle music."
        },
        {
          "name_en": "Valentine's Day",
          "name_es": "Día de San Valentín",
          "description_en": "A holiday celebrating love and affection, commonly marked by the exchange of cards, gifts, and romantic gestures.",
          "description_es": "Una festividad que celebra el amor y el afecto, comúnmente marcada por el intercambio de tarjetas, regalos y gestos románticos.",
          "date": "February 14",
          "season": "Winter",
          "dateType": "fixed",
          "clothing": "Red or pink attire; elegant and formal clothing for romantic dinners.",
          "elements": "Boxes of chocolates, bouquets of red roses, greeting cards, teddy bears, candles, jewelry boxes.",
          "visualSymbols": "Hearts, Cupid with bow and arrow, roses, doves, lace, X's and O's.",
          "locations": "Restaurants, homes, flower shops, candy stores, movie theaters.",
          "timeOfDay": "Evening for romantic dates and dinners.",
          "activities": "Exchanging cards and gifts, romantic dinners, giving flowers and chocolates, couple's activities.",
          "colorPalette": "Red, pink, white, with touches of gold or silver.",
          "flagIsProminent": false,
          "soundEffects": "Soft romantic music, wine pouring, crackling fireplace, opening a box of chocolates, gentle laughter.",
          "musicStyles": "Romantic ballads, love songs from various genres, soft jazz, classical music."
        }
      ]
    },
    "Chile": {
      "holidays": [
        {
          "name_en": "Chilean National Holidays",
          "name_es": "Fiestas Patrias",
          "description_en": "A week-long national celebration commemorating Chile's independence with rodeos, traditional food, and dancing.",
          "description_es": "Una celebración nacional de una semana que conmemora la independencia de Chile con rodeos, comida tradicional y baile.",
          "date": "September 18 and 19",
          "season": "Spring",
          "dateType": "fixed",
          "clothing": "Huaso (cowboy) outfits with ponchos (mantas) and hats; China dresses (colorful dresses with aprons).",
          "elements": "Ramadas (temporary structures for food/drink), fondas (celebration tents), Chilean flags, kites (volantines), barbecue grills (parrillas).",
          "visualSymbols": "Chilean flag, copihue flower, coat of arms, huaso on horseback.",
          "locations": "Nationwide, especially in parks, rural areas, and official parade grounds like Parque O'Higgins in Santiago.",
          "timeOfDay": "All day and night.",
          "activities": "Dancing the Cueca, Chilean rodeo, military parades, flying kites, family barbecues (asados).",
          "colorPalette": "Red, white, and blue.",
          "flagIsProminent": true,
          "soundEffects": "Crowds cheering, Cueca music played on guitar and accordion, galloping horses, sizzling barbecue, military band drums.",
          "musicStyles": "Cueca, Tonada, Cumbia."
        },
        {
          "name_en": "New Year's at the Sea",
          "name_es": "Año Nuevo en el Mar",
          "description_en": "A massive New Year's Eve celebration in Valparaíso featuring the largest fireworks display in South America over the Pacific Ocean.",
          "description_es": "Una masiva celebración de Año Nuevo en Valparaíso que presenta el espectáculo de fuegos artificiales más grande de Sudamérica sobre el Océano Pacífico.",
          "date": "December 31 - January 1",
          "season": "Summer",
          "dateType": "fixed",
          "clothing": "Festive, often white or yellow clothing for good luck; summer party attire.",
          "elements": "Fireworks, confetti, grapes (12 for luck), champagne bottles, yellow streamers.",
          "visualSymbols": "Exploding fireworks over the bay, clock striking midnight, ocean reflections, city lights on the hills.",
          "locations": "Valparaíso's bay, hillsides (cerros), and piers; also prominent in Viña del Mar.",
          "timeOfDay": "Late evening, peaking at midnight.",
          "activities": "Watching fireworks from boats or hills, street parties, family dinners, eating 12 grapes at midnight for luck.",
          "colorPalette": "Deep night blue, black, gold, silver, and vibrant multi-colored fireworks.",
          "flagIsProminent": false,
          "soundEffects": "Massive firework explosions echoing across the bay, ship horns, popping champagne corks, cheering crowds of thousands.",
          "musicStyles": "Cumbia, Reggaeton, international pop music."
        },
        {
          "name_en": "The Festival of Tirana",
          "name_es": "Fiesta de La Tirana",
          "description_en": "A vibrant religious festival in the northern desert blending Catholic and indigenous traditions with colorful masked dances to honor the Virgen del Carmen.",
          "description_es": "Un vibrante festival religioso en el desierto del norte que mezcla tradiciones católicas e indígenas con coloridas danzas de máscaras para honrar a la Virgen del Carmen.",
          "date": "Week surrounding July 16",
          "season": "Winter",
          "dateType": "fixed",
          "clothing": "Elaborate, heavy costumes and masks representing devils (Diablada), bears, and other folkloric characters.",
          "elements": "Ornate masks with horns and mirrors, colorful banners, statues of the Virgin Mary, candles, confetti.",
          "visualSymbols": "Devil masks (Diablo), Virgen del Carmen statue, Andean cross (Chakana).",
          "locations": "The small town of La Tirana in the Atacama Desert.",
          "timeOfDay": "Continuous day and night processions and dances.",
          "activities": "Religious processions, costumed dancing troupes (bailes) performing for hours, street markets, Catholic mass.",
          "colorPalette": "Vibrant primary and secondary colors: red, yellow, green, blue, pink, with gold and silver accents.",
          "flagIsProminent": false,
          "soundEffects": "Loud brass bands, rhythmic drumming, stomping feet of dancers, chanting, firecrackers.",
          "musicStyles": "Andean brass band music (bandas de bronce), religious hymns."
        },
        {
          "name_en": "Grape Harvest Festival",
          "name_es": "Fiesta de la Vendimia",
          "description_en": "A lively celebration of the annual grape harvest in Chile's central wine valleys, featuring grape stomping, wine tasting, and folk music.",
          "description_es": "Una animada celebración de la cosecha anual de la uva en los valles vitivinícolas centrales de Chile, con pisada de uvas, degustación de vinos y música folclórica.",
          "date": "March and April",
          "season": "Fall",
          "dateType": "variable",
          "clothing": "Traditional huaso attire, white peasant-style dresses for grape stomping queens, casual attire for visitors.",
          "elements": "Wooden barrels, grape vines, large vats for stomping, wine glasses, baskets of fresh grapes.",
          "visualSymbols": "Bunches of grapes, wine bottles, grape leaves, vineyard landscapes.",
          "locations": "Wine valleys like Colchagua, Maipo, and Casablanca; main towns such as Santa Cruz and Curicó.",
          "timeOfDay": "Daytime and early evening.",
          "activities": "Grape stomping competitions, wine tasting, election of a Harvest Queen, artisan markets, traditional food stalls.",
          "colorPalette": "Deep purples, greens, burgundy, and earth tones of the countryside.",
          "flagIsProminent": false,
          "soundEffects": "Folk music, laughter, the squishing sound of grapes being stomped, pouring wine, cheering crowds.",
          "musicStyles": "Cueca, Tonada, and other Chilean folk music."
        },
        {
          "name_en": "Navy Day",
          "name_es": "Día de las Glorias Navales",
          "description_en": "A patriotic national holiday honoring the heroes of the Battle of Iquique with grand military and naval parades, primarily in Valparaíso.",
          "description_es": "Un feriado nacional patriótico que honra a los héroes del Combate Naval de Iquique con grandes desfiles militares y navales, principalmente en Valparaíso.",
          "date": "May 21",
          "season": "Fall",
          "dateType": "fixed",
          "clothing": "Formal naval dress uniforms (white or blue), military uniforms, formal civilian attire for officials and spectators.",
          "elements": "Warships, military rifles, marching bands, medals, floral wreaths, Chilean flags.",
          "visualSymbols": "The ship Esmeralda, portrait of Arturo Prat, naval anchor, the Chilean flag on ships and buildings.",
          "locations": "Valparaíso's Plaza Sotomayor and harbor; also in Iquique and Talcahuano.",
          "timeOfDay": "Morning and midday.",
          "activities": "Official ceremony with the President, large-scale naval and military parade, wreath-laying at sea, ships open to the public.",
          "colorPalette": "Navy blue, white, gold, and the red/white/blue of the flag.",
          "flagIsProminent": true,
          "soundEffects": "Military marching band music, cannon fire salutes, synchronized marching steps on pavement, shouted commands, ship horns.",
          "musicStyles": "Military marches, naval hymns."
        },
        {
          "name_en": "Feast of Saint Peter and Saint Paul",
          "name_es": "Fiesta de San Pedro y San Pablo",
          "description_en": "A festival in coastal towns where fishermen honor their patron saint, Saint Peter, with decorated boats and maritime processions.",
          "description_es": "Un festival en pueblos costeros donde los pescadores honran a su santo patrón, San Pedro, con botes decorados y procesiones marítimas.",
          "date": "June 29",
          "season": "Winter",
          "dateType": "fixed",
          "clothing": "Fishermen's work clothes (woolen sweaters, beanies), some traditional dance outfits, warm jackets for the cold sea air.",
          "elements": "Fishing boats adorned with flags and flowers, statues of Saint Peter, fishing nets, oars, seafood.",
          "visualSymbols": "A decorated boat carrying the statue of Saint Peter, keys (symbol of St. Peter), fish, the sea.",
          "locations": "Coastal cities and fishing coves, especially Valparaíso, San Antonio, and the island of Chiloé.",
          "timeOfDay": "Late morning and afternoon.",
          "activities": "A statue of Saint Peter is paraded through the streets and then taken out to sea on a decorated boat, followed by a flotilla of other boats.",
          "colorPalette": "Ocean blues and greens, bright primary colors of flags against the gray winter sea.",
          "flagIsProminent": true,
          "soundEffects": "Boat engines, sea birds calling, foghorns, brass bands playing on boats, waves lapping against hulls.",
          "musicStyles": "Local folk music, Cumbia, religious brass band music."
        },
        {
          "name_en": "Christmas",
          "name_es": "Navidad",
          "description_en": "A summer Christmas celebration focused on family gatherings, midnight mass, and gift-giving, often enjoyed outdoors with a barbecue.",
          "description_es": "Una celebración navideña de verano centrada en reuniones familiares, misa de gallo y entrega de regalos, a menudo disfrutada al aire libre con un asado.",
          "date": "December 24-25",
          "season": "Summer",
          "dateType": "fixed",
          "clothing": "Light, summer clothing; festive but not heavy winter wear (e.g., dresses, shorts, short-sleeve shirts).",
          "elements": "Christmas trees, nativity scenes (pesebres), Pan de Pascua (fruitcake), Cola de Mono (holiday drink), lights on houses.",
          "visualSymbols": "Viejito Pascuero (Old Man Christmas/Santa Claus), nativity scene, star, reindeer decorations in a sunny setting.",
          "locations": "Family homes, backyards, shopping malls, churches, public squares.",
          "timeOfDay": "Main celebration is the evening of the 24th (Nochebuena), with gifts opened at midnight after dinner.",
          "activities": "Family dinner on Christmas Eve, attending Misa del Gallo (Midnight Mass), opening presents, beach or pool outings on Christmas Day.",
          "colorPalette": "Traditional red and green, mixed with bright summer colors and golden sunlight.",
          "flagIsProminent": false,
          "soundEffects": "Christmas carols (villancicos), tearing of wrapping paper, family chatter and laughter, sizzling of a barbecue.",
          "musicStyles": "Villancicos (Christmas carols), Cumbia, international Christmas pop."
        },
        {
          "name_en": "Holy Week",
          "name_es": "Semana Santa",
          "description_en": "A solemn religious observance commemorating the Passion of Christ with processions, church services, and family gatherings, often involving seafood feasts.",
          "description_es": "Una solemne observancia religiosa que conmemora la Pasión de Cristo con procesiones, servicios religiosos y reuniones familiares, a menudo con banquetes de mariscos.",
          "date": "Late March or April",
          "season": "Fall",
          "dateType": "lunar",
          "clothing": "Somber, formal attire for church; some processions may feature hooded robes (nazarenos).",
          "elements": "Crucifixes, candles, statues of Jesus and Mary carried on platforms, palm fronds, seafood dishes.",
          "visualSymbols": "The cross, depictions of the Via Crucis (Stations of the Cross), fish symbol, flickering candlelight.",
          "locations": "Churches and streets nationwide, with notable processions in Santiago, Valparaíso, and small towns.",
          "timeOfDay": "Evening candlelit processions (especially on Good Friday), daytime services.",
          "activities": "Attending mass, participating in processions, family meals featuring fish, exchanging chocolate eggs on Easter Sunday.",
          "colorPalette": "Purple, black, white, and gold, often seen in candlelight or twilight.",
          "flagIsProminent": false,
          "soundEffects": "Church bells tolling slowly, solemn choir music, quiet prayers, unified footsteps on cobblestone streets.",
          "musicStyles": "Sacred choral music, liturgical chants, Gregorian chants."
        }
      ]
    }
  }
}